;Place localized text in this file

[EleriumCorefbbtank X2ItemTemplate]
FriendlyName="Behemoth Tank Part"
FriendlyNamePlural="Behemoth Tank Part"
BriefSummary="Behemoth Tank Part."
LootTooltip="Behemoth Tank Part."


[fbacvplayer X2CharacterTemplate]
strCharacterName="Behemoth Tank"

[fbshivclasshtank X2SoldierClassTemplate]
+DisplayName = "Behemoth Tank"
+ClassSummary = "Behemoth Tank."
+LeftAbilityTreeTitle = "Tank"
+RightAbilityTreeTitle = "Tank"



[intshiv22tank X2TechTemplate]
DisplayName="Build Behemoth Tank"
Summary="Builds a behemoth tank."
CodeName="Behemoth Tank"
LongDescription="Builds a behemoth tank." 
UnlockedDescription="A tank has been built"




[Blasterre X2AbilityTemplate]
LocFriendlyName="Blooming Death"
LocLongDescription="Take multiple blaster shots at a single target"
LocHelpText="Take multiple blaster shots at a single target"
LocFlyOverText="Blooming Death"
LocPromotionPopupText="<Bullet/> Take multiple blaster shots at a target<br/>"

[Blasterreplayer X2AbilityTemplate]
LocFriendlyName="Blooming Death"
LocLongDescription="Take multiple blaster shots at a single target. Creates 2 Heat"
LocHelpText="Take multiple blaster shots at a single target. Creates 2 Heat"
LocFlyOverText="Blooming Death"
LocPromotionPopupText="<Bullet/> Take multiple blaster shots at a target. Creates 2 Heat<br/>"


[tankventshutdown X2AbilityTemplate]
LocFriendlyName="Overheated SHUTDOWN"
LocLongDescription="Overheated SHUTDOWN"
LocHelpText="Overheated SHUTDOWN"
LocFlyOverText="Overheated SHUTDOWN"
LocPromotionPopupText="<Bullet/> Overheated SHUTDOWN<br/>"

[tankventshutdown2 X2AbilityTemplate]
LocFriendlyName="Overheated SHUTDOWN"
LocLongDescription="Overheated SHUTDOWN"
LocHelpText="Overheated SHUTDOWN"
LocFlyOverText="Overheated SHUTDOWN"
LocPromotionPopupText="<Bullet/> Overheated SHUTDOWN<br/>"




[teleporttank X2AbilityTemplate]
LocFriendlyName="Launch"
LocLongDescription="Fly up and come down at target location"
LocHelpText="Fly up and come down at target location"
LocFlyOverText="Launch"
LocPromotionPopupText="<Bullet/> Launch<br/>"

[acvevac X2AbilityTemplate]
LocFriendlyName="Evac"
LocLongDescription="Charge up your launch boosters to evacuate the battlefield on the NEXT TURN"
LocHelpText="Charge up your launch boosters to evacuate the battlefield on the NEXT TURN"
LocFlyOverText="Evac"
LocPromotionPopupText="<Bullet/> Evac<br/>"



[RocketLauncheracv X2AbilityTemplate]
LocFriendlyName="Spinfire Rockets"
LocLongDescription="Spinfire Rockets"
LocHelpText="Spinfire Rockets"
LocFlyOverText="Spinfire Rockets"
LocPromotionPopupText="<Bullet/> Spinfire Rockets<br/>"

[RocketLauncheracvplayer X2AbilityTemplate]
LocFriendlyName="Hailstorm Cannon"
LocLongDescription="Fire an aoe cannon in a cone-shaped area. Creates 2 Heat"
LocHelpText="Fire an aoe cannon in a cone-shaped area. Creates 2 Heat"
LocFlyOverText="Hailstorm Cannon"
LocPromotionPopupText="<Bullet/> Fire an aoe cannon in a cone-shaped area. Creates 2 Heat<br/>"


[Blasterrelaser X2AbilityTemplate]
LocFriendlyName="Precision Beam"
LocLongDescription="Precision Beam"
LocHelpText="Precision Beam"
LocFlyOverText="Precision Beam"
LocPromotionPopupText="<Bullet/> Precision Beam<br/>"

[Blasterrelaserplayer X2AbilityTemplate]
LocFriendlyName="Precision Beam"
LocLongDescription="Precision Beam. Creates 1 Heat"
LocHelpText="Precision Beam. Creates 1 Heat"
LocFlyOverText="Precision Beam"
LocPromotionPopupText="<Bullet/> Precision Beam. Creates 1 Heat<br/>"



[fbacv X2CharacterTemplate]
strCharacterName="Behemoth"


[acv_WPNplayer X2WeaponTemplate]
FriendlyName="Tank Cannons"
BriefSummary="Tank Cannons"
TacticalText="<Bullet/> Tank Cannons."

[acvrocketplayer X2WeaponTemplate]
FriendlyName="Heavy weapons"
BriefSummary="Heavy weapons"
TacticalText="<Bullet/> Heavy weapons."


[acv_laser X2WeaponTemplate]
FriendlyName="Tank laser"
BriefSummary="Tank laser"
TacticalText="<Bullet/> Tank laser."


[SaturationFiretank X2AbilityTemplate]
LocFriendlyName="Saturation fire"
LocLongDescription="Fire all your tanks lasers at a designated cone shaped area. Creates 3 heat"
LocHelpText="Fire all your tanks lasers at a designated cone shaped area. Creates 3 heat"
LocFlyOverText="Saturation fire"
LocPromotionPopupText="<Bullet/> Fire all your tanks lasers at a designated cone shaped area. Creates 3 heat<br/>"

[RunAndGuntank X2AbilityTemplate]
LocFriendlyName="Roll Out"
LocLongDescription="Using this ability will allow the tank to fire after a yellow move. Creates 1 heat"
LocHelpText="Using this ability will allow the tank to fire after a yellow move. Creates 1 heat"
LocFlyOverText="Roll Out"
LocPromotionPopupText="<Bullet/> Using this ability will allow the tank to fire after a yellow move. Creates 1 heat<br/>"

[tankcoolantflush X2AbilityTemplate]
LocFriendlyName="Coolant Flush"
LocLongDescription="Ability which removes all current heat buildup from the tank. Can be Used twice per mission."
LocHelpText="Ability which removes all current heat buildup from the tank. Can be Used twice per mission."
LocFlyOverText="Coolant Flush"
LocPromotionPopupText="<Bullet/> Ability which removes all current heat buildup from the tank. Can be Used twice per mission.<br/>"


[tankoveron X2AbilityTemplate]
LocFriendlyName="Turn On Shutdown Override"
LocLongDescription="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocHelpText="Turn On Shutdown Override"
LocFlyOverText="Override Shutdown"
LocPromotionPopupText="<Bullet/> Shutdown Override<br/>"

[tankoveroff X2AbilityTemplate]
LocFriendlyName="Turn Off Shutdown Override"
LocLongDescription="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocHelpText="Turn Off Shutdown Override"
LocFlyOverText="Override Shutdown"
LocPromotionPopupText="<Bullet/> Shutdown Override<br/>"

[tankoverideshutdown X2AbilityTemplate]
LocFriendlyName="Shutdown Override"
LocLongDescription="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocHelpText="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocFlyOverText="Shutdown Override"
LocPromotionPopupText="<Bullet/> Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead.<br/>"

[tankoverideshutdown2 X2AbilityTemplate]
LocFriendlyName="Shutdown Override"
LocLongDescription="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocHelpText="Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead."
LocFlyOverText="Shutdown Override"
LocPromotionPopupText="<Bullet/> Gives the player the ability to enable/disable automated shutdown when the tank overheats. When enabled the tank will suffer damage instead.<br/>"

[fbacvheatupgrade X2AbilityTemplate]
LocFriendlyName="Additional Heatsinks"
LocLongDescription="Adds additional heatsinks to the tank, allowing it to gain 1 more point of heat before shut down."
LocHelpText="Adds additional heatsinks to the tank, allowing it to gain 1 more point of heat before shut down."
LocFlyOverText="Additional Heatsinks"
LocPromotionPopupText="<Bullet/> Adds additional heatsinks to the tank, allowing it to gain 1 more point of heat before shut down.<br/>"

[tankDemolition X2AbilityTemplate]
LocFriendlyName="Demolition"
LocLongDescription="The tank uses its laser to attempt to destroy the targets cover. Creates 1 heat."
LocHelpText="The tank uses its laser to attempt to destroy the targets cover. Creates 1 heat."
LocFlyOverText="Demolition"
LocPromotionPopupText="<Bullet/> The tank uses its laser to attempt to destroy the targets cover. Creates 1 heat.<br/>"


[tankram1 X2AbilityTemplate]
LocFriendlyName="Ram"
LocLongDescription="Ram nearby enemies for damage and knockback and then reverse back to original position."
LocHelpText="Ram nearby enemies for damage and knockback and then reverse back to original position."
LocFlyOverText="Ram"
LocPromotionPopupText="<Bullet/> Ram nearby enemies for damage and knockback and then reverse back to original position.<br/>"

[laserburnup X2AbilityTemplate]
LocFriendlyName="Concentrated Beam"
LocLongDescription="Upgrades precision beam so that it now lights enemies on fire."
LocHelpText="Upgrades precision beam so that it now lights enemies on fire."
LocFlyOverText="Concentrated Beam"
LocPromotionPopupText="<Bullet/> Upgrades precision beam so that it now lights enemies on fire.<br/>"

[spikedram X2AbilityTemplate]
LocFriendlyName="Spiked Ram"
LocLongDescription="Upgrades the ramming ability to do +6 additional damage."
LocHelpText="Upgrades the ramming ability to do +6 additional damage."
LocFlyOverText="Spiked Ram"
LocPromotionPopupText="<Bullet/> Upgrades the ramming ability to do +6 additional damage.<br/>"

[armorconstruct X2AbilityTemplate]
LocFriendlyName="Construct Armor"
LocLongDescription="The tank can self-repair its own armor 1 piece at a time. Creates 1 heat."
LocHelpText="The tank can self-repair its own armor 1 piece at a time. Creates 1 heat."
LocFlyOverText="Construct Armor"
LocPromotionPopupText="<Bullet/> The tank can self-repair its own armor 1 piece at a time. Creates 1 heat.<br/>"

[tankspinning X2AbilityTemplate]
LocFriendlyName="Death Spiral"
LocLongDescription="The tank rotates 360 degrees while firing, shooting at all enemies around itself in a wide circle. Creates 3 heat and has a 3 turn cooldown."
LocHelpText="The tank rotates 360 degrees while firing, shooting at all enemies around itself in a wide circle. Creates 3 heat and has a 3 turn cooldown."
LocFlyOverText="Death Spiral"
LocPromotionPopupText="<Bullet/> The tank rotates 360 degrees while firing, shooting at all enemies around itself in a wide circle. Creates 3 heat and has a 3 turn cooldown.<br/>"

[tankshieldon X2AbilityTemplate]
LocFriendlyName="Turn Shield On"
LocLongDescription="Turns on the shield.. Granting 4 shield per turn but prevents natural shedding of heat buildup."
LocHelpText="Turns on the shield.. Granting 4 shield per turn but prevents natural shedding of heat buildup."
LocFlyOverText="Turn Shield On"
LocPromotionPopupText="<Bullet/> Turns on the shield.. Granting 4 shield per turn but prevents natural shedding of heat buildup.<br/>"

[tankshieldoff X2AbilityTemplate]
LocFriendlyName="Turn Shield Off"
LocLongDescription="Turn off the shields. Returning the tank to normal heat venting mode."
LocHelpText="Turn off the shields. Returning the tank to normal heat venting mode."
LocFlyOverText="Turn Shield Off"
LocPromotionPopupText="<Bullet/> Turn off the shields. Returning the tank to normal heat venting mode.<br/>"


[tankshield1 X2AbilityTemplate]
LocFriendlyName="Tank Shield System"
LocLongDescription="Grants you a toggle ability to power on or off a 4 HP shield for the tank that will regenerate every turn. However whilst turned on the tank cannot naturally vent heat."
LocHelpText="Grants you a toggle ability to power on or off a 4 HP shield for the tank that will regenerate every turn. However whilst turned on the tank cannot naturally vent heat."
LocFlyOverText="Tank Shield System"
LocPromotionPopupText="<Bullet/> Grants you a toggle ability to power on or off a 4 HP shield for the tank that will regenerate every turn. However whilst turned on the tank cannot naturally vent heat.<br/>"

[RocketLauncheracvplayer2 X2AbilityTemplate]
LocFriendlyName="Vented Flamethrower"
LocLongDescription="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocHelpText="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocFlyOverText="Vented Flamethrower"
LocPromotionPopupText="<Bullet/> This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat.<br/>"

[RocketLauncheracvplayer2a X2AbilityTemplate]
LocFriendlyName="Vented Flamethrower"
LocLongDescription="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocHelpText="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocFlyOverText="Vented Flamethrower"
LocPromotionPopupText="<Bullet/> This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat.<br/>"

[RocketLauncheracvplayer2b X2AbilityTemplate]
LocFriendlyName="Vented Flamethrower"
LocLongDescription="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocHelpText="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocFlyOverText="Vented Flamethrower"
LocPromotionPopupText="<Bullet/> This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat.<br/>"

[RocketLauncheracvplayer2c X2AbilityTemplate]
LocFriendlyName="Vented Flamethrower"
LocLongDescription="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocHelpText="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocFlyOverText="Vented Flamethrower"
LocPromotionPopupText="<Bullet/> This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat.<br/>"

[RocketLauncheracvplayer2d X2AbilityTemplate]
LocFriendlyName="Vented Flamethrower"
LocLongDescription="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocHelpText="This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat."
LocFlyOverText="Vented Flamethrower"
LocPromotionPopupText="<Bullet/> This Flamer taps into the tanks reactor to produce heat in the form of a plasma release. It gets stronger the more heat the tank has built up and cannot fire if the tank has no heat.<br/>"

[shivdamagecontrolacv X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocLongDescription="Every time the tank takes damage it will automatically enhance its armor and provide itself with +1 mitigation for the remainder of the turn. The armor stacks with subsequent attacks."
LocHelpText="Every time the tank takes damage it will automatically enhance its armor and provide itself with +1 mitigation for the remainder of the turn. The armor stacks with subsequent attacks."
LocFlyOverText="Damage Control"
LocPromotionPopupText="<Bullet/> Every time the tank takes damage it will automatically enhance its armor and provide itself with +1 mitigation for the remainder of the turn. The armor stacks with subsequent attacks.<br/>"





